[
  {
    "id": 1,
    "name": "Car Rental System",
    "image": "../src/assets/car-rental.png",

    "tech": [
      "HTML",
      "Tailwindcss",
      "React Js",
      "Daisyui",
      "Express js",
      "Node",
      "MongoDB",
      "Mongoose"
    ],
    "description": "A full-featured car rental platform where users can register, log in, add their own cars for rent, manage bookings, and explore available vehicles with powerful filtering and sorting options.",
    "feature": [
"Create, read, update, and delete (CRUD) car listings through a clean and intuitive interface, enabling users to manage their vehicles efficiently.",
"Easily search for cars and sort listings by price (ascending or descending), improving the user’s ability to find suitable options quickly.",
"Integrated Recharts to display rental statistics and insights, enhancing the admin dashboard with clear and interactive visual analytics."
    ],
    "livesite": "https://car-ride.netlify.app/",
    "clientRepo": "https://github.com/mdsamiulislam54/Car-Rental-System--Client",
    "serverRepo": "https://github.com/mdsamiulislam54/Car-Rental-System-Server"
  },

  {
    "id": 2,
    "name": "MediHaat",
    "image":"../src/assets/madihaat.png",
    "tech": [
      "HTML",
      "Tailwindcss",
      "React Js",
      "Daisyui",
      "Express js",
      "Node Js",
      "MongoDB",
      "Mongoose"
    ],
    "description": "MediHaat is a multi-vendor e-commerce platform for the pharmaceutical industry that lets users easily buy medicines online. It centralizes seller inventory and admin controls to ensure a smooth, reliable, and convenient shopping experience.",
    "feature": [
    " Implemented secure user authentication using Firebase with token-based middleware to enforce distinct access controls for Admin, Seller, and User roles, ensuring data privacy and system integrity.",
    "Developed efficient management tools allowing sellers to add, edit, and track products and earnings, while users can seamlessly monitor orders, payment history, and shopping activities.",
    "Built a full-featured shopping experience featuring dynamic product search and filtering, secure payment processing via Stripe and Cash on Delivery options, and an intuitive cart and checkout workflow optimized for responsiveness."
    ],
    "livesite": "https://medihaat.netlify.app/",
    "clientRepo": "https://github.com/mdsamiulislam54/MediHaat-Client",
    "serverRepo": "https://github.com/mdsamiulislam54/MediHaat-Server"
  },
  {
    "id": 3,
    "name": "DailyMart",
    "image":"../src/assets/dailymart.png",
    "tech": [
      "HTML",
      "Tailwindcss",
      "Swiper Slider",
      "React Js",
      "Express js",
      "Node",
      "MongoDB",
      "Mongoose"
      
    ],
    "description": "DailyMart is a complete e-commerce solution where users can register, login, browse products, add items to cart or wishlist, and securely make payments. It features a dynamic user dashboard and modern UI/UX.",
    "feature": [
     "Implemented secure user authentication system with profile management including image upload",
    
     

     "Developed comprehensive shopping cart with add, update, remove features and integrated SSLCommerz payment gateway for secure transactions.",

     "Built fully responsive UI using React with modern state management (Redux Toolkit) and smooth animations (Swiper.js, Framer Motion) to enhance user experience."
     
    ],

    "livesite": "https://dailymartstore-59c72b-s-dev.netlify.app/",
    "clientRepo": "https://github.com/mdsamiulislam54/Full-Stack-E-Commerce-Project",
    "serverRepo": "https://github.com/mdsamiulislam54/server-side"
  }
]
